# Toposolid Can Be Excavated By Method

Source: https://www.revitapidocs.com/2026/ed8909b2-a302-158b-0eae-05de0c05a40c.htm

---

| Toposolid Can Be Excavated By Method |
| --- |

Checks if the given element can be used to excavate the Toposolid.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool CanBeExcavatedBy(
	ElementId elementId
)
```

```
Public Function CanBeExcavatedBy (
	elementId As ElementId
) As Boolean
```

```
public:
bool CanBeExcavatedBy(
	ElementId^ elementId
)
```

```
member CanBeExcavatedBy :
        elementId : ElementId -> bool
```

#### Parameters

elementId ElementId
:   Id of the element

#### Return Value

Boolean
True if the element can be used to excavate the Toposolid. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

Toposolid Class Autodesk.Revit.DB Namespace